Revit 2027 API
ConnectionValidationWarning Constructor
 Constructor.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ConnectionValidationWarning(
	ConnectionResolution resolution,
	ConnectionWarning reason,
	ElementId part1,
	ElementId part2
)
Public Sub New (
	resolution As ConnectionResolution,
	reason As ConnectionWarning,
	part1 As ElementId,
	part2 As ElementId
)
public:
ConnectionValidationWarning(
	ConnectionResolution resolution,
	ConnectionWarning reason,
	ElementId^ part1,
	ElementId^ part2
)
new :
        resolution : ConnectionResolution *
        reason : ConnectionWarning *
        part1 : ElementId *
        part2 : ElementId -> ConnectionValidationWarning
Parameters
resolution ConnectionResolution
 Resolution type.
reason ConnectionWarning
 Warning reason.
part1 ElementId
 First element Id.
part2 ElementId
 Second element Id.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ConnectionValidationWarning Class
Autodesk.Revit.DB Namespace